final prd
